net.solarnetwork.central.user.billing.killbill.test/src/net/solarnetwork/central/user/billing/killbill/test/account-invoices-01.json

[
  {
    "amount": 18.59,
    "currency": "NZD",
    "status": "COMMITTED",
    "creditAdj": 0,
    "refundAdj": 0,
    "invoiceId": "31b3c76a-3b6a-46ad-b30b-98f21a4e76cd",
    "invoiceDate": "2017-12-06",
    "targetDate": "2017-12-05",
    "invoiceNumber": "16",
    "balance": 18.59,
    "accountId": "e7be50d7-63f1-429b-a5ce-5f950733c2a7",
    "bundleKeys": null,
    "credits": null,
    "items": [],
    "isParentInvoice": false,
    "auditLogs": []
  }
]