net.solarnetwork.central.user.billing.killbill.test/src/net/solarnetwork/central/user/billing/killbill/test/invoice-02.json

{
  "amount": 0.14,
  "currency": "NZD",
  "status": "COMMITTED",
  "creditAdj": 0,
  "refundAdj": 0,
  "invoiceId": "2b717636-56b0-4967-aaab-68d83ba1a455",
  "invoiceDate": "2017-08-28",
  "targetDate": "2017-06-01",
  "invoiceNumber": "3",
  "balance": 0.14,
  "accountId": "e7be50d7-63f1-429b-a5ce-5f950733c2a7",
  "bundleKeys": null,
  "credits": null,
  "items": [
    {
      "invoiceItemId": "6ddf02a0-729a-4922-bfb5-571138d1eec1",
      "invoiceId": "2b717636-56b0-4967-aaab-68d83ba1a455",
      "linkedInvoiceItemId": null,
      "accountId": "7dcfff41-78dd-4171-bae4-e75aa863b927",
      "childAccountId": null,
      "bundleId": "f5632c7d-bc89-4c88-aef2-ee52571e6793",
      "subscriptionId": "f7ec79f7-02ff-4f91-b6ef-f0571ac69baf",
      "planName": "api-posted-datum-metric-monthly-usage",
      "phaseName": "api-posted-datum-metric-monthly-usage-evergreen",
      "usageName": "posted-datum-metric-daily-usage",
      "itemType": "USAGE",
      "description": "posted-datum-metric-daily-usage",
      "startDate": "2017-03-05",
      "endDate": "2017-04-05",
      "amount": 0.14,
      "currency": "NZD",
      "childItems": null,
      "auditLogs": []
    }
  ],
  "isParentInvoice": false,
  "auditLogs": []
}